
#include <iostream>
using namespace std;


int factorial(int n) {
    if (n <= 1) return 1;
    else return n * factorial(n - 1);
}

int main() {
    int number;
    cout << "Enter a number: ";
    cin >> number;
    cout <<  factorial(number);
    return 0;
}
//این  تلبع بازگشتی برای محاسبه  فاکتوریل استفاده میشود  توی قسمت  اول با استفاده از شرط چک میشود که عدد انتخابی کاربر کوچیک تر یا برابر یک بود خود یک رابرگرداند  در غیر این صورت  اون عدد وارد شده در  فاکتوریل یکی کم تر از خودش ضرب میشود   برای مثال عدد سه   عدد سه از یک  کوچک تر است  پس وارد در غیر این صورت میشود  در انجا عدد سه در  فاکتوریل دو ضرب میشود  دوباره  دو به تابع برگشته و  خود عدد دو در فاکتوریل یک ضرب میشود و اینگونه  ادامه گیدا میکند وعدد  شش را به ما میدهد   
